students = [
    {
        "Фамилия": "Натаровский",
        "Имя": "Александр",
        "Пол": "М",
        "Возраст": 19,
        "Группа": "ИСП-407",
        "Оценка по математике": 5,
        "Оценка по физике": 4,
        "Оценка по химии": 4,
    },
    {
        "Фамилия": "Ерохин",
        "Имя": "Максим",
        "Пол": "М",
        "Возраст": 20,
        "Группа": "ИСП-407",
        "Оценка по математике": 5,
        "Оценка по физике": 3,
        "Оценка по химии": 3,
    },
    {
        "Фамилия": "Курако",
        "Имя": "Вячеслав",
        "Пол": "М",
        "Возраст": 18,
        "Группа": "ИСП-407",
        "Оценка по математике": 5,
        "Оценка по физике": 5,
        "Оценка по химии": 5,
    },
    {
        "Фамилия": "Браташин",
        "Имя": "Арсений",
        "Пол": "М",
        "Возраст": 19,
        "Группа": "ИСП-407",
        "Оценка по математике": 4,
        "Оценка по физике": 5,
        "Оценка по химии": 3,
    },
]

sorted_students = sorted(students, key=lambda x: x["Оценка по физике"], reverse=True)

for student in sorted_students:
    print(f"{student['Фамилия']}- {student['Оценка по физике']}")
